<template>
	<view>
		<view class="pd15">
			<view class="question-title">{{content.title}}</view>
			<view v-for="item in content.content">
				<view class="question-h4" v-if="item.h4">{{item.h4}}</view>
				<view>{{item.question}}</view>
				<view class="answer" v-html="item.answer" v-if="item.html"></view>
				<view class="answer" v-else>{{item.answer}}</view>
			</view>
		</view>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				list: [{
						title: '分部和驾校认证',
						content: [{
								question: '问1：提供的认证材料可以是复印件吗？',
								answer: '认证材料的复印件事可以上传的。'
							},
							{
								question: '问2：没有教练认证可以申请吗？',
								answer: '教练需要由分部直接邀请添加。'
							},
							{
								question: '问3：没有教练车行驶可以认证码？',
								answer: '如果您是教练，没有教练车行驶证，分部是不可以添加邀请您成为教练的。'
							},
							{
								question: '问4：如何删除本驾校教练？',
								answer: '在分部的教练列表中可以删除不是本分部的教练。'
							},
						]
					},
					{
						title: '预约管理',
						content: [{
								question: '问1：为什么有的学员不能预约？',
								answer: '该学员的学习进度还没有达到预约的条件。'
							},
							{
								question: '问2：教练授课和取消学员预约，学员能接受到通知吗？',
								answer: '只要不取消学员的预约练车，表示预约成功，接受学员的约课。学员根据预约的时间进行练车。如果需要取消学员的预约练车，根据提示选择给学员拨打电话或者给学员发送信息，确保学员能及时收到预约练车被取消。'
							},
							{
								question: '问3：删除学员预约练会同时删除学员吗？',
								answer: '您在预约授课模块删除学员的预约，只会删除该时段学员的预约安排，不会删除学员，学员仍然与您存在绑定关系。'
							},
						]
					},
					{
						title: '奖励金',
						content: [{
								question: '问1：奖励金可以提现吗？',
								answer: '奖励金是不能提现的。'
							},
							{
								question: '问2：奖励金可以做什么？',
								answer: '奖励金是“链车”平台的虚拟货币，在购买第三方服务且购买“链车”平台的商品时可以当做现金抵扣。'
							},
							{
								question: '问3：奖励金最多可以抵扣多少？',
								answer: '奖励金最多可以抵扣消费值的30%。'
							},
							{
								question: '问4：如何获取奖励金？',
								answer: '获取奖励金的方式有很多，签到、完成奖励金任务。'
							},
						]
					},
					{
						title: '绑定教练',
						content: [{
							question: '问1：学员怎么绑定自己的教练？',
							answer: '教练邀请添加自己的学员，然后确认学员信息，绑定成功。'
						}, ]
					},
					{
						title: '新增驾校',
						content: [{
							question: '问1：找不到自己的驾校怎么办？',
							answer: '邀请自己的所属驾校负责人，按照认证程序认证驾校。'
						}, ]
					},
					{
						title: '互动（关注、点赞、评论、个人主页）',
						content: [{
								h4: '关注',
								question: '问1：为什么关注失败？',
								answer: '您无法关注每一个人吗？可能是您短时间内频繁关注他人，导致系统拥堵，请提供界面提示截屏到意见反馈。'
							},
							{
								question: '问2：为什么粉丝数不对？',
								answer: '粉丝取消关注，请提供对方链车号。有其他情况请提供问题的界面截屏并尽量详细描述下出现该情况的操作步骤到意见反馈。'
							},
							{
								h4: '喜欢',
								question: '问1：如何取消喜欢？',
								answer: '您点击进入已经喜欢的视频后，点击右侧的心形按钮即可取消对该视频的喜欢。'
							},
							{
								question: '问2：为什么喜欢失败？',
								answer: '您是点击喜欢后没有反应吗？还是每次喜欢后都不显示呢？请提供问题的界面截屏并尽量详细描述下出现该情况的操作步骤到意见反馈。'
							},
							{
								question: '3：为什么取消不了喜欢？',
								answer: '请提供该视频的视频截图，工作人员会尽快查看。'
							},
							{
								h4: '喜欢',
								question: '问1：如何取消喜欢？',
								answer: '您点击进入已经喜欢的视频后，点击右侧的心形按钮即可取消对该视频的喜欢。'
							},
							{
								h4: '评论',
								question: '问1：为什么评论发送不出去',
								answer: '请提供问题的界面截屏并尽量详细描述下出现该情况的操作步骤到意见反馈。',
							},
							
							{
								h4: '分享',
								question: '问1：无法分享到第三方怎么办',
								answer: '请先升级至最新版本尝试，如果仍无法分享，请提供问题的界面截屏并尽量详细描述下出现该情况的操作步骤到意见反馈。'
							},
							
							{
								h4: '个人主页',
								question: '问1：为什么我的作品无法显示或显示不全',
								answer: '	请更换网络环境试试，若依旧存在该问题请提供问题的界面截屏并尽量详细描述下出现该情况的操作步骤到意见反馈。'
							},
						]
					},
					{
						title: '视频（播放、录制、上传、时长）',
						content: [{
								h4: '时长',
								question: '问1：可以上传多长时间的视频？',
								answer: '可以上传视频的时长为60秒。'
							},
							{
								h4: '播放',
								question: '问1：视频播放不了、卡顿是怎么办？',
								answer: '每个时候均如此吗，切换下其他网络环境再试试呢？如仍然存在该问题，请详细描述视频无法播放或者卡顿的具体情况，并提供问题的截屏到意见反馈，我们会尽快查看。'
							},
							{
								question: '问2：视频播放有声音没有画面，有画面没有声音，声音和画面不同步，画面模糊等情况怎么办？',
								answer: '是所有的视频都会出现上述的某种情况吗？还是仅某个视频呢？请把出现问题的视频界面和截屏提交到意见反馈，我们会尽快查看。'
							},
							{
								question: '问3：视频播放时遇到其他问题怎么办？',
								answer: '是所有的视频都会出现上述的某种情况吗？请把出现问题的视频界面和截屏提交到意见反馈，我们会尽快查看。'
							},
							{
								h4: '上传',
								question: '问1：视频上传失败怎么办？',
								answer: '每次均如此吗？您尝试却换下当前网络状态试试呢，如果仍有问题请提供问题的界面截屏并尽量详细描述下出现该情况的操作步骤到意见反馈。'
							},
							{
								question: '问2：视频上传一半不动了怎么办？',
								answer: '您的视频上传到一半后停止了吗？请描述下出现该情况的操作步骤，并提供页面上方的上传进度条截屏到意见反馈。'
							},
							{
								question: '问3：视频上传后模糊怎么办？',
								answer: '3.1您是哪一步操作后变模糊呢？如果您是发布后播放模糊，您的视频已发布了多久？<br/>3.2请提供具体的视频标题截图。请您将描述和截图提交到意见反馈。'
							},
							{
								question: '问4：视频上传遇到其他问题怎么办？',
								answer: '请描述下出现该情况的操作步骤，和情况截屏到意见反馈。'
							},
							{
								h4: '录制',
								question: '问1：为什么无法录制视频，提示开启摄像/录音权限？',
								html: true,
								answer: `若因摄像头/录音权限导致无法拍摄，请先更新只最新版本并尝试以下方法：<br />
								1.1安卓用户，若您未开启拍摄权限，可在设置应用权限中允许使用拍摄和录音权限，两个权限缺一不可；若您当前的摄像头被其他应用占用，请关闭其他应用程序或重启手机后重试。<br />
								1.2ios用户，可尝试<br />
								1）麦克风权限：“设置”---“屏幕使用时间”---“内容和隐私访问限制”---“麦克风”---选择“允许更改”，并在“链车”APP中获得权限授权即可。<br />
								2）相机权限：“设置”---“屏幕使用时间”---“内容和隐私访问限制”---“允许应用”--“相机”。设置完毕后请重新启动“链车”APP后在尝试。<br />
								若以上方法仍无法解决，请提供问题的界面截图并尽量详细描述出出现的情况到意见反馈。`
							},
							{
								question: '问2：为什么添加滤镜失败？',
								answer: '每次均如此吗？请提供问题的界面截屏并尽量详细描述下出现该情况的操作步骤到意见反馈。'
							},
							{
								h4: '编辑',
								question: '问1：为什么调不了原声大小？',
								answer: '请问您是一点声音都没有呢，还是没有自己的原声呢？如果您选择了音乐之后进行录制，就无法添加或调整原声，您可以进行录制再添加音乐。'
							},
							{
								question: '问2：为什么无法剪辑？',
								answer: '每次录制均如此吗？请提供问题的界面截屏并尽量详细描述下出现该情况的操作步骤到意见反馈。'
							},
						]
					},

					{
						title: '功能故障（闪退、死机、升级）',
						content: [{
								h4: '闪退',
								question: '问1：拍摄、上传视频时发生闪退怎么办？',
								answer: '每次均如此吗？您是在哪个界面出现的闪退呢？请提供问题的界面截屏并尽量详细描述下出现该情况的操作步骤到意见反馈。'
							},
							{
								question: '问2：播放视频时发生闪退怎么办？',
								answer: '您是在“首页--推荐页”观看的视频时闪退呢，还是其他播放界面闪退呢？请提供问题的界面截屏并尽量详细描述下出现该情况的操作步骤到意见反馈。'
							},
							{
								h4: '无反应/停止运行',
								question: '问1：上传、播放视频无反应/停止运行怎么办？',
								answer: '每次均如此吗？您是在哪个界面出现的该问题呢？请提供问题的界面截屏并尽量详细描述下出现该情况的操作步骤到意见反馈。'
							},
							{
								h4: '无连不上网/刷不出新内容',
								question: '问1：无连不上网/刷不出新内容怎么办？',
								answer: '请提供一下四个信息：1.出问题的界面截图，2您所在的城市，3刷不了时时用WIFI还是移动网络，4所连WIFI的宽带运营商或移动网络运营商。将以上数据和截图提交到意见反馈。'
							},
							{
								h4: '无法升级',
								question: '问1：安卓手机无法升级怎么办？',
								answer: '您在手机中安装的应用市场中下载我们的最新版本试试，您无法升级的时候是否有弹出什么错误提示呢?请提供问题的界面截屏并尽量详细描述下出现该情况的操作步骤到意见反馈。'
							},
							{
								question: '问2：ios手机无法升级怎么办？',
								answer: '您在AppStore中搜索“链车”后进入App详情页，点击“更新”按钮试试呢?如仍无法升级，请提供问题的界面截屏并尽量详细描述下出现该情况的操作步骤到意见反馈。'
							},
						]
					},
					{
						title: '注销账号',
						content: [{
							html: true,
							question: '问1：我该怎么注销账号？',
							answer: `您要注销账号要具备以下几点要求：<br />
							1) 账号处于安全状态<br />
							2) 账号财产已结清（没有资产、欠款、未结清的资金和虚拟权益）<br />
							3) 账号权限解除<br />
							4) 账号无任何纠纷，包括投诉举报<br />
							如果满足以上4点情况，请联系“链车”平台的工作人员申请注销账号。`
						}]
					}
				]
			}
		},
		onLoad(options) {

			let idx = options.idx
			this.content = this.list[idx];
			console.log(options.idx)
		},
		methods: {

		}
	}
</script>

<style scoped>
	.question-title {
		font-size: 40rpx;
		font-weight: 800;
		text-align: center;
		padding-bottom: 30rpx;
	}

	.answer {
		color: #999;
		padding-left: 48rpx;
		margin: 20rpx 0;
	}
	.question-h4 {
		font-size: 32rpx;
		margin-bottom: 10rpx;
	}
</style>
